/*
*Напишите программу, демонстрирующую автоматическую упаковку примиитивных типов.
*/

public class Main {
    public static void main(String[] args) {
        Integer i = new Integer(45);
        System.out.println(i);

        int j = new Integer(45);
        System.out.println(j);

        System.out.println(j+i);
    }
}
