/*
* Выведите наибольшее и наименьшее число в экспоненциальной записи для 
* типов float и double.
*/

public class Main {

    public static void main(String[] args) {
        System.out.println("Float\n max: " + Float.MAX_VALUE + "\n min: " + Float.MIN_VALUE);

        System.out.println("Double\n max: " + Double.MAX_VALUE + "\n min: " + Double.MIN_VALUE);
    }
}
