/*
* Напишите программу, в которой используются как «короткие», так и «длинные» команды печати.
*/

public class Main {
    public static void main(String[] args) {
        System.out.println("Длинная команда печати");
        out.print("Короткая команда печати");

    }
}
